OpenFOAM case folders/Experimental validation/Calm water resistance/KCS/Fr0.1516/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-14.638348587506528 0 -8.189285923080575)
	(21.95752288125979 0 -8.189285923080575)
	(21.95752288125979 9.212946663465647 -8.189285923080575)
	(-14.638348587506528 9.212946663465647 -8.189285923080575)
	(-14.638348587506528 0 3.8387277764440197)
	(21.95752288125979 0 3.8387277764440197)
	(21.95752288125979 9.212946663465647 3.8387277764440197)
	(-14.638348587506528 9.212946663465647 3.8387277764440197)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (143 36 47) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

